**`teams/nomis/rhel_7_9_baseimage`** terraform plan on `push` event [#696](https://github.com/ministryofjustice/modernisation-platform-ami-builds/actions/runs/3428297642)

```
module.imagebuilder["rhel_7_9_baseimage"].data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder["rhel_7_9_baseimage"].data.terraform_remote_state.imagebuilder_mp: Reading...
data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder["rhel_7_9_baseimage"].data.terraform_remote_state.imagebuilder_mp: Read complete after 2s
module.imagebuilder["rhel_7_9_baseimage"].data.terraform_remote_state.core_shared_services_production: Read complete after 3s
data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
data.aws_secretsmanager_secret_version.environment_management: Reading...
data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
data.aws_caller_identity.current: Reading...
module.imagebuilder["rhel_7_9_baseimage"].data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Reading...
module.imagebuilder["rhel_7_9_baseimage"].data.aws_ami.parent[0]: Reading...
module.imagebuilder["rhel_7_9_baseimage"].data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder["rhel_7_9_baseimage"].data.aws_ami.parent[0]: Read complete after 1s [id=<REDACTED>]
data.aws_caller_identity.current: Read complete after 1s [id=<REDACTED>]
data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder["rhel_7_9_baseimage"].data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder["rhel_7_9_baseimage"].data.aws_imagebuilder_component.this["update-linux"]: Read complete after 1s [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_component.this["../components/ansible.yml.tftpl"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-ansible/1.4.7/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: nomis_rhel_7_9_baseimage_ansible
            description: Install ansible roles for nomis_rhel_7_9_baseimage
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 1.4.7
          +       default: 1.4.8
                  description: Uses the recipe version to avoid any issues with the branch template arg.
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  # Install ansible roles
                  - name: InstallAndRunAnsible
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
          +               # do not set -u as it breaks on RedHat 6
                          set -e
                          run_ansible() {
                            repo="modernisation-platform-ami-builds"
                            ami_tag="nomis_rhel_7_9_baseimage"
            
                            # clone ansible roles and playbook
                            ansible_dir=$(mktemp -d)
          -                 echo "Cloning $repo into $ansible_dir using branch=nomis/DSOS-1440/rhel610-fix"
          +                 echo "Cloning $repo into $ansible_dir using branch=main"
                            cd $ansible_dir
          -                 git clone -b nomis/DSOS-1440/rhel610-fix "https://github.com/ministryofjustice/$repo.git"
          +                 git clone -b main "https://github.com/ministryofjustice/$repo.git"
            
                            # set python version
                            if [[ $(which python3.9 2> /dev/null) ]]; then
                              python=$(which python3.9)
                            elif [[ $(which python3.6 2> /dev/null) ]]; then
                              python=$(which python3.6)
                            else
                              echo "Python3.9/3.6 not found"
                              exit 1
                            fi
                            echo "python: $python"
            
                            # install python dependencies outside of virtual env so ansible
                            # can be executed remotely
                            cd $ansible_dir/$repo/ansible
                            $python -m pip install -r requirements.txt
            
                            # activate virtual environment
                            mkdir $ansible_dir/python-venv && cd "$_"
                            $python -m venv ansible
          - 
          -                 # activate script fails on RHEL6 if set -u
          -                 set +u
                            source ansible/bin/activate
                            $python -m pip install --upgrade pip
                            if [[ "$python" =~ 3.6 ]]; then
                              $python -m pip install wheel
                              $python -m pip install cryptography==2.3
                              export LC_ALL=en_US.UTF-8
                              $python -m pip install ansible-core==2.11.12
                            else
                              $python -m pip install ansible==6.0.0
                            fi
            
                            # install requirements in virtual env
                            cd $ansible_dir/$repo/ansible
                            $python -m pip install -r requirements.txt
                            ansible-galaxy role install -r requirements.yml
                            ansible-galaxy collection install -r requirements.yml --force
            
                            # run ansible (note comma after localhost is deliberate)
                            ansible-playbook site.yml \
                            --connection=local \
                            --inventory localhost, \
                            --extra-vars "ansible_python_interpreter=$python" \
                            --extra-vars "target=localhost" \
                            --extra-vars "@group_vars/ami_$ami_tag.yml" \
                            --tags amibuild \
                            --become
            
                            # Cleanup
                            deactivate
                            echo "Cleaning up $ansible_dir"
                            rm -rf $ansible_dir/$repo
                            rm -rf $ansible_dir/python-venv
                            rmdir $ansible_dir
                          }
          -               echo "ansible start" | logger -p local3.info -t ami-component
          +               echo "ansible nomis_rhel_7_9_baseimage start" | logger -p local3.info -t ami-component
                          run_ansible 2>&1 | logger -p local3.info -t ami-component
          -               echo "ansible end" | logger -p local3.info -t ami-component
          +               echo "ansible nomis_rhel_7_9_baseimage end" | logger -p local3.info -t ami-component
        EOT
      ~ date_created          = "2022-11-09T10:02:57.673Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-ansible/1.4.7/1" -> (known after apply)
        name                  = "nomis_rhel_7_9_baseimage_ansible"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "1.4.7" -> "1.4.8" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_component.this["../components/rhel_7_9_baseimage/packages.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-packages/0.0.1/1"
        name                  = "nomis_rhel_7_9_baseimage_packages"
      ~ tags                  = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_component.this["../components/rhel_7_9_baseimage/python.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-python/0.0.1/1"
        name                  = "nomis_rhel_7_9_baseimage_python"
      ~ tags                  = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-rhel-7-9-baseimage"
        name         = "nomis_rhel_7_9_baseimage"
      ~ tags         = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-7-9-baseimage" -> (known after apply)
      ~ date_created                     = "2022-11-09T10:03:01.847Z" -> (known after apply)
      ~ date_last_run                    = "2022-11-09T10:04:04.067Z" -> (known after apply)
      ~ date_next_run                    = "2022-12-01T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2022-11-09T10:03:01.847Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-7-9-baseimage" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-baseimage/1.4.7" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-baseimage-1-4-7" -> (known after apply)
        name                             = "nomis_rhel_7_9_baseimage"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-baseimage/1.4.7" -> (known after apply)
      ~ date_created     = "2022-11-09T10:03:00.432Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-baseimage/1.4.7" -> (known after apply)
        name             = "nomis_rhel_7_9_baseimage"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "1.4.7" -> "1.4.8" # forces replacement
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-ansible/1.4.7/1" -> (known after apply) # forces replacement
        }

        # (5 unchanged blocks hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-baseimage-1-4-7" -> (known after apply)
      ~ date_created                  = "2022-11-09T10:02:57.965Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-baseimage-1-4-7" -> (known after apply)
      ~ name                          = "nomis_rhel_7_9_baseimage_1_4_7" -> "nomis_rhel_7_9_baseimage_1_4_8" # forces replacement
      ~ resource_tags                 = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "branch"                                    = "nomis/DSOS-1440/rhel610-fix" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.7" -> "nomis_rhel_7_9_baseimage/1.4.8"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.7" -> "1.4.8"
          ~ "release-or-patch"                          = "test" -> "n/a"
            # (11 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 3 to change, 4 to destroy.

```
